//функция для парсинга массива attributes. Находит все цвета товара и соответствующий штрихкод
export function parseAttributes(attributes) {
  const res = [];
  const seenColors = new Set();

  for (let i = 0; i < attributes.length; i++) {
      if (attributes[i].id === 1000000001) {
          const colorValue = attributes[i].value;
          
          if (!seenColors.has(colorValue)) {
              let temp = { color: colorValue };
              
              for (let j = i + 1; j < attributes.length; j++) {
                  if (attributes[j].id === 1000000011) {
                      temp.code = attributes[j].value;
                      res.push(temp);
                      seenColors.add(colorValue);
                      i = j;
                      break;
                  }
              }
          }
      }
  }
  
  return res;
}

//функция, которая по тексту определяет hex кодировку цвета
export function findColorHex(input) {
  const colors = [
      { in: ['зеленый', 'салатовый'], out: '#00FF00' },
      { in: ['красный', 'бордовый'], out: '#FF0000' },
      { in: ['синий', 'голубой', 'лазурный'], out: '#0000FF' },
      { in: ['черный', 'ночной'], out: '#000000' },
      { in: ['белый', 'молочный'], out: '#FFFFFF' },
      { in: ['желтый', 'лимонный'], out: '#FFFF00' },
      { in: ['фиолетовый', 'сиреневый'], out: '#800080' },
      { in: ['оранжевый', 'апельсиновый'], out: '#FFA500' },
      { in: ['розовый', 'персиковый','фуксия'], out: '#FFC0CB' },
      { in: ['коричневый', 'шоколадный'], out: '#A52A2A' },
      { in: ['серый', 'древесный'], out: '#808080' },
      { in: ['бирюзовый', 'цвет морской волны'], out: '#40E0D0' },
      { in: ['золотой', 'медовый'], out: '#FFD700' },
      { in: ['серебряный', 'металлик'], out: '#C0C0C0' },
      { in: ['пурпурный', 'малиновый'], out: '#FF00FF' },
      { in: ['оливковый', 'хаки'], out: '#808000' },
      { in: ['бежевый', 'песочный'], out: '#F5F5DC' },
      { in: ['изумрудный', 'лесной'], out: '#228B22' },
      { in: ['горчичный', 'желто-коричневый'], out: '#FFDB58' },
      { in: ['лавандовый', 'лиловый'], out: '#E6E6FA' },
      { in: ['янтарный', 'топазовый'], out: '#FFBF00' },
      { in: ['индиго'], out: '#4B0082' },
      { in: ['охра', 'теплый желтый'], out: '#CC7722' },
      { in: ['аквамарин'], out: '#7FFFD4' },
      { in: ['мятный'], out: '#98FF98' },
      { in: ['небесный', 'голубовато-синий'], out: '#87CEEB' },
      { in: ['ягодный'], out: '#8A2BE2' },
      { in: ['коралловый'], out: '#FF7F50' },
      { in: ['шампань'], out: '#F7E7CE' },
      { in: ['сиреневый'], out: '#C8A2C8' },
      { in: ['кремовый'], out: '#FFFDD0' },
      { in: ['маренго'], out: '#4C5866' },
      { in: ['малахит'], out: '#0BDA51' },
      { in: ['аметист'], out: '#9966CC' },
      { in: ['изысканный серый'], out: '#BEBEBE' },
      { in: ['лавандовый серый'], out: '#C4C3D0' },
      { in: ['кофейный'], out: '#6F4E37' },
      { in: ['сепия'], out: '#704214' },
      { in: ['циан'], out: '#00FFFF' },
      { in: ['ореховый'], out: '#D2691E' },
      { in: ['вайолет'], out: '#EE82EE' },
      { in: ['графитовый'], out: '#2F4F4F' },
      { in: ['сапфировый'], out: '#0F52BA' },
      { in: ['песчаный'], out: '#C2B280' },
      { in: ['матовый'], out: '#696969' },
      { in: ['спаржевый'], out: '#87A96B' },
      { in: ['акцентный'], out: '#CD5C5C' },
      { in: ['кобальтовый'], out: '#0047AB' },
      { in: ['жасминовый'], out: '#F8DE7E' },
      { in: ['рубиновый'], out: '#E0115F' },
      { in: ['ржавчина'], out: '#B7410E' },
      { in: ['пастельно-голубой'], out: '#AEC6CF' },
      { in: ['лазурно-синий'], out: '#007FFF' },
      { in: ['морковный'], out: '#ED9121' },
      { in: ['лесной зелёный'], out: '#228B22' },
      { in: ['медный'], out: '#B87333' },
      { in: ['серо-голубой'], out: '#8AA7A9' },
      { in: ['электрик'], out: '#7DF9FF' },
      { in: ['сливовый'], out: '#8E4585' },
      { in: ['перламутровый'], out: '#EAE0C8' },
      { in: ['мятно-зеленый'], out: '#98FF98' },
      { in: ['патиновый'], out: '#78866B' },
      { in: ['туман'], out: '#C9C0BB' },
      { in: ['соломенный'], out: '#F4A460' },
      { in: ['кедровый'], out: '#A0522D' },
      { in: ['кобальт'], out: '#0047AB' },
      { in: ['пепельный'], out: '#B2BEB5' },
      { in: ['винный'], out: '#722F37' },
      { in: ['ливандовый'], out: '#F5F5DC' },
      { in: ['мятный'], out: '#98FF98' },
      { in: ['перламутр'], out: '#FFD700' },
      { in: ['пыльно-розовый'], out: '#DCAE96' },
      { in: ['грушевый'], out: '#D1E231' },
      { in: ['пальмовый'], out: '#228B22' },
      { in: ['изумрудный'], out: '#50C878' },
      { in: ['древесный'], out: '#DEB887' },
      { in: ['океан'], out: '#4682B4' },
      { in: ['дубовый'], out: '#A0522D' },
      { in: ['пурпур'], out: '#800080' },
      { in: ['крем'], out: '#FFFDD0' },
      { in: ['лазурь'], out: '#E0FFFF' },
      { in: ['малиновый'], out: '#DB7093' },
      { in: ['фиалковый'], out: '#8A2BE2' },
      { in: ['лосось'], out: '#FA8072' },
      { in: ['тэтрапоп'], out: '#CFB53B' },
      { in: ['шоколад'], out: '#D2691E' },
      { in: ['индиго'], out: '#4B0082' },
      { in: ['топаз'], out: '#FFBF00' },
      { in: ['алый'], out: '#FF2400' }
  ];

  const defaultHex = '#B02465'; // Цвет по умолчанию R:176 G:36 B:101

  const words = input.toLowerCase().split(/[\s\-\/]+/);

  for (let word of words) {
      for (let color of colors) {
          if (color.in.includes(word)) {
              return color.out;
          }
      }
  }

  return defaultHex;
}